#Область о //Обновление ИБ:

// Обработчик обновления УТ 11.0.0.6
//
// Первоночальное заполнение.
//
Процедура ПервоночальноеЗаполнение_11_0_0_6() Экспорт
	
	// 2020 год:
	Набор = РегистрыСведений.инкКонфигурацияВыплатВФонды.СоздатьНаборЗаписей();
	Набор.Очистить();
	
	// 		Обл. база на каждого работника с нач. года:
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ОблагаемаяБазаВЗН;
	Запись.ПФ		= 1292000;
	Запись.ФСС  	= 912000;
	Запись.ФФОМС	= 0;
	
	//		Тариф в пределах лимита:
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ТарифВПределахЛимита;
	Запись.ПФ		= 22;
	Запись.ФСС  	= 2.9;
	Запись.ФФОМС	= 5.10;
	
	// 		Тариф сверх лимита:
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ТарифСверхЛимита;
	Запись.ПФ		= 11;
	Запись.ФСС  	= 1.45;
	Запись.ФФОМС	= 2.55;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
