
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
		   
	ПараметрыОткрытия = Новый Структура;
		   
	ОткрытьФорму("ОбщаяФорма.инкВыборПериода", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		Новый УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасчетныеЛисткиНаСервере(Период,СотрудникиМассив)
    
    Если Не ЗначениеЗаполнено(СотрудникиМассив) Тогда
        Возврат Неопределено;
    КонецЕсли; 
    
	МенеджерПечати = Обработки.инкРасчетныеЛисты.Создать();
	МенеджерПечати.СотрудникиМассив = СотрудникиМассив;
	МенеджерПечати.Дата1 = Период.ДатаНачала;
	МенеджерПечати.Дата2 = Период.ДатаОкончания;
	ТабличныйДокумент = МенеджерПечати.ПолучитьРасчетныеЛистки();

	Возврат ТабличныйДокумент; 
	
КонецФункции

&НаКлиенте
Процедура ВыборСотрудниковЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		Период = ДополнительныеПараметры.Период;
		СотрудникиМассив = РезультатРедактирования.СотрудникиМассив;
        
		ТабличныйДокумент = ПолучитьРасчетныеЛисткиНаСервере(Период,СотрудникиМассив);
        инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Расчетные листки",Неопределено);

	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыборПериодаЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		ДопПараметры = Новый Структура("Период",РезультатРедактирования.Период);
		Оповещение = Новый ОписаниеОповещения("ВыборСотрудниковЗавершение", ЭтотОбъект, ДопПараметры);
			   
		ПараметрыОткрытия = Новый Структура;
			   
		ОткрытьФорму("ОбщаяФорма.инкВыборСотрудников", 
			ПараметрыОткрытия,
			ЭтотОбъект,
			Новый УникальныйИдентификатор,
			,
			,
			Оповещение,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	
КонецПроцедуры 

