			
#Область о // Стандартные процедуры и функции:

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Год = Год(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПериодОтДанных(Команда)                                              
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Год",Объект.Год);

	ТекстВопроса = НСтр("ru = 'Будет произведена очистка регистров от данных. Продолжить?'");
	Оповещение = Новый ОписаниеОповещения("ВопросУдалениеДанныхЗавершение", ЭтотОбъект,ДопПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

	//ОчиститьПериодОтДанныхНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПринудительнаяОчисткаВсехРегистров(Команда)

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Год",0);

	ТекстВопроса = НСтр("ru = 'Будет произведена очистка регистров от данных. Продолжить?'");
	Оповещение = Новый ОписаниеОповещения("ВопросУдалениеДанныхЗавершение", ЭтотОбъект,ДопПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ВопросУдалениеДанныхЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
    	ПринудительнаяОчисткаВсехРегистровНаСервере(ДопПараметры.Год);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПринудительнаяОчисткаВсехРегистровНаСервере(Год)

	МенеджерРасчета = РеквизитФормыВЗначение("Объект");
	МенеджерРасчета.ОчиститьПроизводсвенныйКалендарь(Год);
	МенеджерРасчета.ОчиститьНормуВремени(Год);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	ЗагрузитьДанныеНаСервере();
	
КонецПроцедуры
                               
&НаСервере
Процедура ЗагрузитьДанныеНаСервере()

	МенеджерРасчета = РеквизитФормыВЗначение("Объект");
    МенеджерРасчета.ЗагрузитьДанныеНаСервере(Объект.Год);

КонецПроцедуры
     						   
#КонецОбласти			
