
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьОтборСписка();	
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборСписка()

	Перем ПараметрыОтбора, РежимОтображения;

	Если Параметры.Свойство("ПараметрыОтбора", ПараметрыОтбора) И ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда 
		
		Отбор = Список.Отбор.Элементы;

		Для Каждого ЭлементСтруктуры Из ПараметрыОтбора Цикл 
			
			ИмяОтбора = ЭлементСтруктуры.Ключ;
			НастройкаОтбора = ЭлементСтруктуры.Значение;
			Если НЕ НастройкаОтбора.Свойство("РежимОтображения", РежимОтображения) Тогда 
				РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли;
			ЭлементОтбора = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ИдентификаторПользовательскойНастройки = ИмяОтбора;
			ЭлементОтбора.Представление = ИмяОтбора;
			ЭлементОтбора.ПредставлениеПользовательскойНастройки = ИмяОтбора;
			ЭлементОтбора.РежимОтображения = РежимОтображения;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ВидСравнения = НастройкаОтбора.ВидСравнения;
			ЭлементОтбора.ЛевоеЗначение = НастройкаОтбора.ЛевоеЗначение;
			ЭлементОтбора.ПравоеЗначение = НастройкаОтбора.ПравоеЗначение;

		КонецЦикла;	

	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//Закрыть(ЭтаФорма.Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры


