#Область о //Дополнительные процедуры и функции:

// Функция - Получить перечень больничных листов
//
// Параметры:
//  Параметры	 - структура - Параметры для запроса 
// 
// Возвращаемое значение:
//   - массив значений - массив ссылок документа "Больничный лист".
//
Функция ПолучитьПереченьОтпусков(Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкРеестрОтпусков.Регистратор КАК Регистратор,
		|	инкРеестрОтпусков.Сотрудник КАК Сотрудник,
		|	инкРеестрОтпусков.МесяцНачисления КАК МесяцНачисления,
		|	СУММА(инкРеестрОтпусков.Сумма) КАК Сумма
		|ИЗ
		|	РегистрСведений.инкРеестрОтпусков КАК инкРеестрОтпусков
		|ГДЕ
		|	инкРеестрОтпусков.Сотрудник = &Сотрудник
		|	И инкРеестрОтпусков.МесяцНачисления = &МесяцНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	инкРеестрОтпусков.Регистратор,
		|	инкРеестрОтпусков.Сотрудник,
		|	инкРеестрОтпусков.МесяцНачисления";
	
	Запрос.УстановитьПараметр("МесяцНачисления", Параметры.МесяцНачисления);
	Запрос.УстановитьПараметр("Сотрудник", Параметры.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	
	Возврат РезультатЗапроса;	
	
КонецФункции

#КонецОбласти	 

#Область о //Печать: 

#КонецОбласти