#Область о //Служебные процедуры и функции:

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЗаписьДвижений_инкРеестрОтпусков();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти	

#Область о //Дополнительные процедуры и функции:

#КонецОбласти	

#Область о //Запись движений:

Процедура ЗаписьДвижений_инкРеестрОтпусков()
	
	Движения.инкРеестрОтпусков.Записывать = Истина;
	
	Движение = Движения.инкРеестрОтпусков.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
	Движение.Отпуск = ЭтотОбъект.Ссылка;
	
КонецПроцедуры

#КонецОбласти	

