
&НаСервере
Перем мОбъектОтчета;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабличныйДокумент.Очистить();
	СформироватьСтруктуруРеквизитовФормы(Параметры, СтруктураРеквизитовФормы);
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("ВзносыСортировкаПоОблагаемойБазе");
	                 	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	инкОтчетыСервер.УстановитьНастройкиМаштабаДокумента(ТабличныйДокумент);
	ТабличныйДокумент.Автомасштаб = Истина;
	
	Элементы.ГруппаВзносыМСБ.Видимость = СтруктураРеквизитовФормы.ДанныеДляРасчетаВзносов.Организация.ПредприятиеМалогоИлиСреднегоБизнеса;
 	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы(Параметры, СтруктураРеквизитовФормы) 
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("ТабличныеДокументы");
	СтруктураРеквизитовФормы.Вставить("ДанныеДляРасчетаВзносов");
	
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормы,Параметры);
	
	СтруктураРеквизитовФормы.Вставить("НаименованиеОтчета", "Соцналог");
	СтруктураРеквизитовФормы.Вставить("ТекущаяСтрокаРазделовОтчета");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");

	//СтруктураРеквизитовФормы.Вставить("ВысотаСтрокиРаздела1", 9);
	//СтруктураРеквизитовФормы.Вставить("ВысотаСтрокиРаздела2", 6);
	//СтруктураРеквизитовФормы.Вставить("ЦветЗаполняетсяАвтоАрифметика", Новый Цвет(192, 220, 192));
	//СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов", Новый СписокЗначений);
	//СтруктураРеквизитовФормы.Вставить("мПечатныеФормы", Новый СписокЗначений);
	//СтруктураРеквизитовФормы.Вставить("мПечатаемыеРазделы", Новый СписокЗначений);
	//СтруктураРеквизитовФормы.Вставить("ВариантыФорматовВыгрузки", Новый СписокЗначений);
	//СтруктураРеквизитовФормы.Вставить("НачальноеЗначениеНаимОрганизации", "");
	//СтруктураРеквизитовФормы.Вставить("ВыводитьСтраницуВТаблДокНаСервере",Истина);
	//СтруктураРеквизитовФормы.Вставить("мАвтоВыборКодов");
	//СтруктураРеквизитовФормы.Вставить("мВерсияФормы");
	//СтруктураРеквизитовФормы.Вставить("мВариант");
	//СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	//СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	//СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	//СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	//СтруктураРеквизитовФормы.Вставить("Организация");
	//СтруктураРеквизитовФормы.Вставить("НаимОрганизации");
	//СтруктураРеквизитовФормы.Вставить("СтрПериодОтчета");
	//СтруктураРеквизитовФормы.Вставить("ТекстДляЗаголовочнойЧасти");
	//СтруктураРеквизитовФормы.Вставить("АдресВоВремХранилищеТаблицаСоставПоказателей");
	////
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыОтчетаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ИмяТекРаздела = СтрЗаменить(Строка(ТекущаяСтраница.Имя),"Группа","");
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СтруктураРеквизитовФормы.ТабличныеДокументы[ИмяТекРаздела]);
	
КонецПроцедуры




