
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДаннымиПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиПоУмолчаниюНаСервере()
	
	Организация							= Справочники.инкОрганизации.НайтиПоКоду("000000002");
	Подразделение						= Справочники.инкПодразделения.ПустаяСсылка();
	ПериодРасчетаВзносов.ДатаНачала		= НачалоГода(Дата("20200101000000"));
	ПериодРасчетаВзносов.ДатаОкончания  = КонецГода(Дата("20200101000000"));
	//Сотрудник = Справочники.инкСотрудники.НайтиПоКоду("000000001"); // Абрамов Г.С. 
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетВзносов(Команда)
	
	ПараметрыФормы = ПолучитьРасчетВзносовНаСервере();
	
	Если ЭтоВнешняяОбработкаОтчет() Тогда
		ОткрытьФорму("ВнешняяОбработка.инкРасчетВзносов.Форма.ФормаОтчетаАналитика", ПараметрыФормы, , Истина);
	Иначе
		ОткрытьФорму("Обработка.инкРасчетВзносов.Форма.ФормаОтчетаАналитика", ПараметрыФормы, , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьРасчетВзносовНаСервере()
	
	МенеджерРасчета = РеквизитФормыВЗначение("Объект");
	//
	МенеджерРасчета.Инициализация();
	//
	МенеджерРасчета.ДанныеДляРасчетаВзносов.Организация = Организация;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		МенеджерРасчета.ДанныеДляРасчетаВзносов.ПодразделенияМассив.Добавить(Подразделение);
	КонецЕсли;
	МенеджерРасчета.ДанныеДляРасчетаВзносов.Дата1 = ПериодРасчетаВзносов.ДатаНачала;
	МенеджерРасчета.ДанныеДляРасчетаВзносов.Дата2 = ПериодРасчетаВзносов.ДатаОкончания;
	МенеджерРасчета.ДанныеДляРасчетаВзносов.СформироватьТабличныеДокументы = Истина;
	//
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		МенеджерРасчета.ДанныеДляРасчетаВзносов.СотрудникиМассив.Добавить(Сотрудник);
	КонецЕсли;
	
	//
	МенеджерРасчета.ВыполнитьРасчетВзносов();
	//         
	
	ДанныеСтруктура = Новый Структура;
	ДанныеСтруктура.Вставить("ТабличныеДокументы",МенеджерРасчета.ТабличныеДокументы);
	ДанныеСтруктура.Вставить("ДанныеДляРасчетаВзносов",МенеджерРасчета.ДанныеДляРасчетаВзносов);
	
	Возврат ДанныеСтруктура; 
	  	
КонецФункции

&НаСервере
Функция ЭтоВнешняяОбработкаОтчет()
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	Возврат инкОбщийСервер.ЭтоВнешняяОбработкаОтчет(ОбъектОбработка);
	
КонецФункции
