
#Область о //Стандартные процедуры и функции:

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Параметры.АдресПараметровВХранилище) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ПараметрыРасчета = ПолучитьИзВременногоХранилища(Параметры.АдресПараметровВХранилище);
	
	мПрочиеНачисленияТаблица.Очистить();
	Для каждого СотрудникЭлемент из ПараметрыРасчета.СотрудникиМассив Цикл
		НачислениеСтрока = мПрочиеНачисленияТаблица.Добавить();
		НачислениеСтрока.Сотрудник = СотрудникЭлемент;
	КонецЦикла;
	
	Элементы.мПрочиеНачисленияТаблица.Доступность = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура мПрочиеНачисленияТаблицаПриИзменении(Элемент)
	                            
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиСписком(Команда)
	
	РазмерНачисленияСумма = Элементы.мПрочиеНачисленияТаблица.ТекущиеДанные.РазмерНачисления;
	
	Если ЗначениеЗаполнено(РазмерНачисленияСумма) Тогда
		
		ДопПараметры = Новый Структура("РазмерНачисления",РазмерНачисленияСумма);
		
		ТекстВопроса = НСтр("ru = 'Ввести списком "+РазмерНачисленияСумма+"?'");
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьСпискомТЧВедомостьЗавершение", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьСпискомТЧВедомостьЗавершение(Знач Результат, Знач ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
	
		КолВо = мПрочиеНачисленияТаблица.Количество()-1;
		СчЦикла = 0;
		Для СчЦикла = 0 По КолВо Цикл
			Элементы.мПрочиеНачисленияТаблица.ДанныеСтроки(СчЦикла)["РазмерНачисления"] = ДопПараметры.РазмерНачисления;
		КонецЦикла;
						
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Начислить(Команда)
	
	ДопПараметры = Новый Структура;
	
	ТекстВопроса = НСтр("ru = 'Выполнить начисление?'");
	Оповещение = Новый ОписаниеОповещения("НасчислитьЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры                                                 

&НаКлиенте
Процедура НасчислитьЗавершение(Знач Результат, Знач ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
	
		Закрыть(ПоместитьИзмененныеДанныеВоВременноеХранилище());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(мНачисление) Тогда
		
		Элементы.мПрочиеНачисленияТаблица.Доступность = Истина;
		Для каждого НачислениеСтрока Из мПрочиеНачисленияТаблица Цикл
			НачислениеСтрока.Начисление = мНачисление;
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПереносВОсновнуюФорму

&НаСервере
Функция ПоместитьИзмененныеДанныеВоВременноеХранилище()
	         	
	ВозвращаемыеСведения = Новый Структура;
	ВозвращаемыеСведения.Вставить("мПрочиеНачисленияТаблица", Неопределено);
	
	Если ЗначениеЗаполнено(мНачисление) Тогда
		ВозвращаемыеСведения.мПрочиеНачисленияТаблица = мПрочиеНачисленияТаблица.Выгрузить();
	КонецЕсли; 
	
	Возврат ПоместитьВоВременноеХранилище(ВозвращаемыеСведения, Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти


