
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчаниюНаСервере()
	
	Организация = Справочники.инкОрганизации.НайтиПоКоду("000000001"); // ООО "Конфетпром"
	Период.ДатаНачала = НачалоГода(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
	ЗагрузитьПодразделенияНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодразделенияНаСервере()
	
	ПодразделенияОрганизации = инкОбщийСервер.ПолучитьПодразделенияОрганизацииНаСервере(Организация);
	Для каждого ПодразделениеСтрока из ПодразделенияОрганизации Цикл
		
		ПодразделениеФорма = ПодразделенияТаблица.Добавить();
		ПодразделениеФорма.Подразделение = ПодразделениеСтрока.Подразделение;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗагрузитьПодразделенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкиВТаблице(Отметка)
	
	Для каждого ПодразделениеСтрока Из ПодразделенияТаблица Цикл
		ПодразделениеСтрока.ВыборСтроки = Отметка;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)        	
	УстановитьОтметкиВТаблице(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	УстановитьОтметкиВТаблице(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьВыделение(Команда)
	
	Для каждого ПодразделениеСтрока Из ПодразделенияТаблица Цикл
		ПодразделениеСтрока.ВыборСтроки = Не (ПодразделениеСтрока.ВыборСтроки);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	ПоискВыбор = Новый Структура("ВыборСтроки",Истина);
	ПодразделенияМассив = ПодразделенияТаблица.НайтиСтроки(ПоискВыбор);
	
	РезультатВыбора = Новый Массив;
	Для каждого ПодразделениеСтрока из ПодразделенияМассив Цикл
		РезультатВыбора.Добавить(ПодразделениеСтрока.Подразделение);	
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПодразделениеМассив",РезультатВыбора);
	ДополнительныеПараметры.Вставить("Организация",Организация);
	ДополнительныеПараметры.Вставить("Дата1",Период.ДатаНачала);
	ДополнительныеПараметры.Вставить("Дата2",Период.ДатаОкончания);
	
	ЭтаФорма.Закрыть(ДополнительныеПараметры);
	
КонецПроцедуры

