
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Год = ТекущаяДата();
	Объект.НомерКорректировки = "00";
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокументНаСервере(ПараметрыПечати)
	
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	МенеджерПечати.СотрудникиМассив = ПараметрыПечати.СотрудникиМассив;
	МенеджерПечати.Организация = ПараметрыПечати.Организация;
	ТабличныйДокумент = МенеджерПечати.ПолучитьРезультатРасчета();

	Возврат ТабличныйДокумент; 
	
КонецФункции

&НаКлиенте
Процедура ВыборСотрудниковЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		ТабличныйДокумент = ПолучитьТабличныйДокументНаСервере(РезультатРедактирования);
		инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Справка 2 НДФЛ",ЭтаФорма);
			
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Печать(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборСотрудниковЗавершение", ЭтотОбъект);
		   
	ПараметрыОткрытия = Новый Структура;
		   
	ОткрытьФорму("ОбщаяФорма.инкВыборСотрудников", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
