
Процедура ЗаполнениеРеквизитовОбъекта(Отказ)
	
	// Заполнение табельного номера:
	Если Не ЗначениеЗаполнено(ТабельныйНомер) Тогда
		ТабельныйНомер = ЭтотОбъект.Код;
	КонецЕсли;
	
	// Заполнение фио:
	ФИО = Фамилия + " " + Имя + " " + Отчество;
	ФИОСокращенное = Фамилия + " " + Лев(Имя,1) + "." + Лев(Отчество,1) + ".";
	
	// Имущественный вычет:
	Если ЭтотОбъект.ИмущественныйВычетСумма <> 0 Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ИмущественныйВычетКодВычета) Тогда
			Отказ = Истина;
			инкОбщийКлиентСервер.СообщитьПользователю("Внимание! У имущественного вычета должен быть указан код вычета.");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ЗаполнениеРеквизитовОбъекта(Отказ);
	
КонецПроцедуры

