
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЗагрузитьЗначенияРеквизитовПоУмолчанию();
    
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗначенияРеквизитовПоУмолчанию()
    
    мОрганизация = Справочники.инкОрганизации.НайтиПоКоду("000000001");
	мПериодОтчета = инкОбщийСервер.ПолучитьПериодРегламентногоОтчетаПоДате(ТекущаяДата());
	
	// Отладка:
	мОрганизация = Справочники.инкОрганизации.НайтиПоНаименованию("ООО ""Инкомсофт""");
	//мГод = Год(ТекущаяДата());
	мГод = 2020;
	мПериодОтчета = Перечисления.инкПериодыРегламентныхОтчетов.ПервыйКвартал;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчета(Команда)
	
	ДанныеСтруктура = Новый Структура;
	ДанныеСтруктура.Вставить("Организация", мОрганизация);
	ДанныеСтруктура.Вставить("Подразделение", мПодразделение);
	ДанныеСтруктура.Вставить("ПериодКвартала", инкОбщийСервер.СтандартныйПериодПоГодуИПериодуРегламентногоОтчета(мГод,мПериодОтчета));
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АдресПараметровВХранилище", инкОбщийСервер.АдресПараметровВХранилище(ДанныеСтруктура,УникальныйИдентификатор));
	
	ПолноеИмяФормыСтрока = инкОбщийКлиент.ПолучитьПолноеИмяФормы(ЭтаФорма,"ФормаОтчетаАналитика");
 	ОткрытьФорму(ПолноеИмяФормыСтрока, 
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		,
		РежимОткрытияОкнаФормы.Независимый);
		
КонецПроцедуры

