
#Область о // Общие процедуры и функции:

// Проверка наличия реквезита в объекте:
Функция ЕстьСвойство(Объект, ИмяСвойства) Экспорт
	
	РезультатФункции = Ложь;
    НачальноеЗНачение = Новый УникальныйИдентификатор();
    ЗначениеРеквизита = Новый Структура(ИмяСвойства, НачальноеЗНачение);
	
	ЗаполнитьЗначенияСвойств(ЗначениеРеквизита, Объект);
    Если ЗначениеРеквизита[ИмяСвойства] <> НачальноеЗНачение Тогда
        РезультатФункции = Истина;
    КонецЕсли;
    Возврат РезультатФункции;
	
КонецФункции

// Выводит сообщение пользователю:
Процедура СообщитьПользователю(Текст, ОбъектДанных = Неопределено, Поле = "") Экспорт

	Текст = Строка(ТекущаяДата())+ ": " + Текст;
	
	Если ОбъектДанных = Неопределено Тогда
		
		Сообщить(Текст);
		
	Иначе 
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Текст;
		Сообщение.УстановитьДанные(ОбъектДанных);
		Сообщение.Поле = Поле;
		Сообщение.Сообщить();			

	КонецЕсли;
	
КонецПроцедуры

// Функция - Финансовое округление. Корректно округляет до двух копеек.
//
// Параметры:
//  ФинансововеЧисло - Число      - Число для огругления. 
// 
// Возвращаемое значение:
//   - Число. 
//
Функция ФинансовоеОкругление(ФинансововеЧисло) Экспорт
    
    ФинансововеЧисло = Окр(ФинансововеЧисло,3);
    ФинансововеЧисло = Окр(ФинансововеЧисло,2,РежимОкругления.Окр15как20); 
    
    Возврат ФинансововеЧисло; 
    
КонецФункции                                           

#КонецОбласти

#Область о // Работа с датой и временем:

// Функция - Квартал по дате
//
// Параметры:
//  Дата -  дата    - дата по которой определяется квартал
// 
// Возвращаемое значение:
//   - число - номер квартала
//
Функция КварталПоДате(Дата) Экспорт  
    
    Возврат Цел((Месяц(Дата) - 1) / 3) + 1
    
КонецФункции

// Получить номер квартала по номеру месяца
Функция КварталПоМесяцу(НомерМесяца) Экспорт
	
	Квартал = 0 ;
	Если (НомерМесяца >= 1) И (НомерМесяца <= 3) Тогда
		Квартал = 1;	
	ИначеЕсли (НомерМесяца >= 4) И (НомерМесяца <= 6) Тогда 	
		Квартал = 2;
	ИначеЕсли (НомерМесяца >= 7) И (НомерМесяца <= 9) Тогда 	
		Квартал = 3;
	ИначеЕсли (НомерМесяца >= 10) И (НомерМесяца <= 12) Тогда 	
		Квартал = 4;		
	КонецЕсли;
		
	Возврат Квартал;	
		
КонецФункции

#КонецОбласти