
Функция ПолучитьСтрукруруДанныхНачисленияЗарплаты(Объект) Экспорт
	
	стрДанныеНачисления = Новый Структура;
	
	стрДанныеНачисления.Вставить("ОбъектНачисленияЗарплаты",Объект);
	стрДанныеНачисления.Вставить("Подразделение",Объект.Подразделение);
	стрДанныеНачисления.Вставить("Организация",Объект.Организация);
	стрДанныеНачисления.Вставить("МесяцНачисления",Объект.МесяцНачисления);
	стрДанныеНачисления.Вставить("СотрудникиМассив",Новый Массив);
	стрДанныеНачисления.Вставить("булСортировкаПоСотрудникам",Истина);
	стрДанныеНачисления.Вставить("булПерерасчет",Ложь);
	
	Возврат стрДанныеНачисления; 
	
КонецФункции

