
#Область о //Служебные процедуры и функции:

Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаписьДвижений_инкКадроваяИсторияСотрудников();
	ЗаписьДвижений_инкПлановыеНачисления();
	ЗаписьДвижений_инкПлановыеУдержания();
			
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    ОбновлениеИнформацииОСотруднике(РежимЗаписи);
    
КонецПроцедуры

#КонецОбласти	

#Область о //Дополнительные процедуры и функции:

Процедура ОбновлениеИнформацииОСотруднике(Режим)
    
    обСотрудник = ЭтотОбъект.Сотрудник.ПолучитьОбъект();
    
    Если Режим = РежимЗаписиДокумента.Проведение Тогда
                
        ЗаполнитьЗначенияСвойств(обСотрудник,ЭтотОбъект);
    
    ИначеЕсли Режим = РежимЗаписиДокумента.ОтменаПроведения Тогда
        
        обСотрудник.Организация = Неопределено;
    	обСотрудник.Подразделение = Неопределено; 
    	обСотрудник.Должность = Неопределено;
        обСотрудник.ДатаПриемаНаРаботу = Неопределено;
        
    	ЭтотОбъект.Оклад = 0;
    	ЭтотОбъект.РайонныйКоэффициент = 0;
    	ЭтотОбъект.СевернаяНадбавка = 0;

    КонецЕсли; 

	обСотрудник.Записать();
	
КонецПроцедуры
 
#КонецОбласти	

#Область о //Запись движений:

Процедура ЗаписьДвижений_инкКадроваяИсторияСотрудников()
	
	Движения.инкКадроваяИсторияСотрудников.Записывать = Истина;
	
	Движение = Движения.инкКадроваяИсторияСотрудников.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
	Движение.Период = НачалоДня(ДатаПриемаНаРаботу);
    Движение.ВидСобытия = Перечисления.инкВидыКадровыхСобытий.Прием;
	
КонецПроцедуры

Процедура ЗаписьДвижений_инкПлановыеНачисления();
	
	Движения.инкПлановыеНачисления.Записывать = Истина;
	
	Для каждого стрНачисления из ЭтотОбъект.ПлановыеНачисления Цикл
		
		Движение = Движения.инкПлановыеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(Движение,стрНачисления);
		Движение.Период = НачалоДня(ДатаПриемаНаРаботу);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаписьДвижений_инкПлановыеУдержания();
	
	Движения.инкПлановыеУдержания.Записывать = Истина;
	
	Для каждого стрУдержания из ЭтотОбъект.ПлановыеУдержания Цикл
		
		Движение = Движения.инкПлановыеУдержания.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(Движение,стрУдержания);
		Движение.Период = НачалоДня(ДатаПриемаНаРаботу);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти	

