&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДокументРасчетаЗарплаты = Документы.инкНачислениеЗарплаты.НайтиПоНомеру("00000000001",Дата("20210101000000"));
	СотрудникРасчет = Справочники.инкСотрудники.НайтиПоКоду("000000002");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РежимРасчетаДокумента = "ПересчитатьДокумент";
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьДокументНаСервере(ПересчитатьДокумент = Ложь)
	
	обНачислениеЗП  = Объект.ДокументРасчетаЗарплаты.ПолучитьОбъект();
	стрДанныеНачисленияЗарплаты = инкРасчетЗаработнойПлатыСервер.ПолучитьСтрукруруДанныхНачисленияЗарплаты(обНачислениеЗП);
	стрДанныеНачисленияЗарплаты.булПерерасчет = ПересчитатьДокумент;
	
	МенеджерРасчета = РеквизитФормыВЗначение("Объект");
	МенеджерРасчета.Инициализация();
	МенеджерРасчета.ДанныеНачисленияЗарплаты = стрДанныеНачисленияЗарплаты;
	Если ЗначениеЗаполнено(СотрудникРасчет) Тогда
		МенеджерРасчета.ДанныеНачисленияЗарплаты.СотрудникиМассив.Добавить(СотрудникРасчет);
	КонецЕсли;
	МенеджерРасчета.ВыполнитьРасчетЗаработнойПлаты();
	
	РежимЗаписи = РежимЗаписиДокумента.Запись;
	Если обНачислениеЗП.Проведен Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	обНачислениеЗП.Записать(РежимЗаписи);
	
	ЗначениеВРеквизитФормы(МенеджерРасчета, "Объект");

	инкОбщийКлиентСервер.СообщитьПользователю("Записан документ: "+обНачислениеЗП.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДокумент(Команда)
	
	ПересчитатьДокумент = Ложь;
	Если РежимРасчетаДокумента = "ПересчитатьДокумент" Тогда
		ПересчитатьДокумент = Истина;
	КонецЕсли;
		
	ПерезаполнитьДокументНаСервере(ПересчитатьДокумент);
	
КонецПроцедуры





