
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Параметры.АдресПараметровВХранилище) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	СформироватьСтруктуруРеквизитовФормы(Параметры, СтруктураРеквизитовФормы);
	
	ЗагрузитьДанныеОтчетаНаФорму(СтруктураРеквизитовФормы,Отказ);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы(Параметры, СтруктураРеквизитовФормы) 
	
	СтруктураРеквизитовФормы = Новый Структура;
    СтруктураРеквизитовФормы.Вставить("ТабличныеДокументы");
	СтруктураРеквизитовФормы.Вставить("АдресПараметровВХранилище",Параметры.АдресПараметровВХранилище);
	
    ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормы,Параметры);

КонецПроцедуры     

&НаСервере
Процедура ЗагрузитьДанныеОтчетаНаФорму(СтруктураРеквизитовФормы, Отказ)

    ЗагрузитьТабличныеДокументы(СтруктураРеквизитовФормы, Отказ);
    
    ЗагрузитьДанныеТабличногоДокумента(СтруктураРеквизитовФормы,"ВедомостьНачислений");
    ЗагрузитьДанныеТабличногоДокумента(СтруктураРеквизитовФормы,"ВедомостьУдержаний");
    
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеТабличногоДокумента(СтруктураРеквизитовФормы,ИмяЛиста)

    ТабличныйДокумент = СтруктураРеквизитовФормы.ТабличныеДокументы[ИмяЛиста]; 
    
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	инкОтчетыСервер.УстановитьНастройкиМаштабаДокумента(ТабличныйДокумент);
	ТабличныйДокумент.Автомасштаб = Истина;

    ЭтотОбъект["м"+ИмяЛиста] = ТабличныйДокумент;
    
КонецПроцедуры     

&НаСервере
Процедура ЗагрузитьТабличныеДокументы(СтруктураРеквизитовФормы, Отказ)
	
	//
	ПараметрыРасчета = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресПараметровВХранилище);
	//
	
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	МенеджерПечати.Инициализация();
	МенеджерПечати.ДанныеДляОтчета = ПараметрыРасчета;
	СтруктураРеквизитовФормы.ТабличныеДокументы = МенеджерПечати.ПолучитьТабличныеДокументы();

КонецПроцедуры

