
#Область о // Описание переменных:

	// мПараметрыФормы - структура, получается из временного хранилища.
	//	- СотрудникиМассив - массив, массив справочника инкСотрудники;
	//	- ВопросПриВыборе - строка, вопрос который задаст форма при выборе сотрудников перед закрытием;

#КонецОбласти

#Область о // Стандартные процедуры и функции:

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Параметры.АдресПараметровВХранилище) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// 
	
	мПараметрыФормы = ПолучитьИзВременногоХранилища(Параметры.АдресПараметровВХранилище);
	СотрудникиМассив = мПараметрыФормы.СотрудникиМассив;
	
	ЗаполнитьДаннымиФормуНаСервере(СотрудникиМассив);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиФормуНаСервере(СотрудникиМассив)
	
	НачальныйСписокСотрудников.Очистить();
	ВыбранныеСотрудники.Очистить();
	
	Для каждого СотрудникЭлемент Из СотрудникиМассив Цикл
		НачисленияУдержанияВыборСтрока = НачальныйСписокСотрудников.Добавить();
		НачисленияУдержанияВыборСтрока.Сотрудник = СотрудникЭлемент;
	КонецЦикла; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура КомандаПеренестиВПравоОдно(Команда)
	
	ТекущиеДанные = Элементы.НачальныйСписокСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		СтрокаКУдалению =  ВыбранныеСотрудники.Добавить();
	    ЗаполнитьЗначенияСвойств(СтрокаКУдалению,ТекущиеДанные);
		НачальныйСписокСотрудников.Удалить(НачальныйСписокСотрудников.Индекс(ТекущиеДанные));
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВлевоОдно(Команда)
	
	ТекущиеДанные = Элементы.ВыбранныеСотрудники.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		СтрокаВыбор=  НачальныйСписокСотрудников.Добавить();
	    ЗаполнитьЗначенияСвойств(СтрокаВыбор,ТекущиеДанные);
		ВыбранныеСотрудники.Удалить(ВыбранныеСотрудники.Индекс(ТекущиеДанные));
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВправоВсе(Команда)
	
	Для каждого СтрокаВыбор Из НачальныйСписокСотрудников Цикл
		СтрокаКУдалению =  ВыбранныеСотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКУдалению,СтрокаВыбор);
	КонецЦикла; 
	
	НачальныйСписокСотрудников.Очистить();
	     	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВлевоВсе(Команда)
	
	Для каждого СтрокаКУдалению Из ВыбранныеСотрудники Цикл
		СтрокаВыбор = НачальныйСписокСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыбор,СтрокаКУдалению);
	КонецЦикла; 
	
	ВыбранныеСотрудники.Очистить();

КонецПроцедуры 

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ВыбранныеСотрудники.Количество() > 0 Тогда
		
		ДопПараметры = Новый Структура;
		
		ТекстВопроса = НСтр("ru = '"+мПараметрыФормы.ВопросПриВыборе+"'");
		Оповещение = Новый ОписаниеОповещения("ВыбратьЗавершение", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗавершение(Знач Результат, Знач ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Закрыть(ПоместитьИзмененныеДанныеВоВременноеХранилище());	
	КонецЕсли;                                                   	
		
КонецПроцедуры

#КонецОбласти

#Область о // Перенос данных в основную форму:

&НаСервере
Функция ПоместитьИзмененныеДанныеВоВременноеХранилище()
	
	ВозвращаемыеСведения = Новый Структура;
	ВозвращаемыеСведения.Вставить("СотрудникиМассив", ВыбранныеСотрудники.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
	Возврат ПоместитьВоВременноеХранилище(ВозвращаемыеСведения, Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

