
// Функция - Получить контактный телефон организации
// 
// Возвращаемое значение:
//   - строка 
//
Функция ПолучитьКонтактныйТелефонОрганизации(ЭтотОбъект) Экспорт
	
	КонтактныйТелефон = "";
	ПоискТелефона = Новый Структура;
	ПоискТелефона.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.КонтактныйТелефонОрганизации); 
	
	КонтактнаяИнформацияМассив = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(ПоискТелефона);
	
	Для каждого КонтактнаяИнформацияЭлемент Из КонтактнаяИнформацияМассив Цикл
		КонтактныйТелефон = КонтактнаяИнформацияЭлемент.Представление;
	КонецЦикла; 
	
	Возврат КонтактныйТелефон;	
	
КонецФункции
 