
#Область о //Обновление ИБ:

// Обработчик обновления УТ 11.0.0.6
//
// Первоночальное заполнение.
//
Процедура ПервоночальноеЗаполнение_11_0_0_6() Экспорт
	
	//	На 2020 год:
	//	Особые условия труда:
	Набор = РегистрыСведений.инкОсобыеУсловияТруда.СоздатьНаборЗаписей();
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Опасный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс4;
	Запись.Тариф                = 8; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Вредный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс34;
	Запись.Тариф                = 7; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Вредный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс33;
	Запись.Тариф                = 6; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Вредный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс32;
	Запись.Тариф                = 4; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Вредный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс31;
	Запись.Тариф                = 2; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Допустимый;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс2;
	Запись.Тариф                = 0; 
	//
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.УсловияТрудаКласс	= Перечисления.инкУсловияТрудаКласс.Оптимальный;	
 	Запись.УсловияТрудаПодкласс = Перечисления.инкУсловияТрудаПодкласс.Подкласс1;
	Запись.Тариф                = 0; 
	//
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
