#Область о //Обновление ИБ

// Обработчик обновления УТ 11.0.0.2
//
// Установка размеров предельных сумм вычетов и мрот.
//
Процедура УстановитьНастройкиСтандартныхВычетов_11_0_0_2() Экспорт
	
	инкСтандартныеВычетыНастройкиМенеджер = РегистрыСведений.инкСтандартныеВычетыНастройки.СоздатьМенеджерЗаписи();
	инкСтандартныеВычетыНастройкиМенеджер.Период = НачалоГода(Дата("20200101000000"));
	инкСтандартныеВычетыНастройкиМенеджер.Мрот                          = 12130;
	инкСтандартныеВычетыНастройкиМенеджер.МаксимальнаяСуммаНаДетей      = 350000;
	инкСтандартныеВычетыНастройкиМенеджер.Записать(Истина);
	  
КонецПроцедуры

#КонецОбласти