
#Область о // Обновление 11.0.0.11:

&НаСервере
Процедура ОписатьКодУдержанияСтруктура(УдержаниеСтруктура)
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовРасчета.инкУдержания." + УдержаниеСтруктура.ИмяПредопределенныхДанных);
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Элемент = СсылкаПредопределенного.ПолучитьОбъект();                                      
	Иначе
		Элемент = ПланыВидовРасчета.инкУдержания.СоздатьЭлемент();
	КонецЕсли;
                       
	ЗаполнитьЗначенияСвойств(Элемент,УдержаниеСтруктура);	
	Элемент.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьКодыУдержаний_11_0_0_11() Экспорт
	
	Кредит50 = 	ПланыСчетов.инкХозрасчетный.Касса;
	Кредит51 = 	ПланыСчетов.инкХозрасчетный.РасчетныеСчета;
	Кредит76 =  ПланыСчетов.инкХозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами;
	
	// Аванс:
	УдержаниеСтруктура = Новый Структура;
	УдержаниеСтруктура.Вставить("Код","10001");
	УдержаниеСтруктура.Вставить("Наименование","Аванс");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","Аванс");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит",Кредит50);
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00080");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Выпл. отпуск. и б/л в текущем месяце:
	УдержаниеСтруктура = Новый Структура;  
	УдержаниеСтруктура.Вставить("Код","10002");
	УдержаниеСтруктура.Вставить("Наименование","Выпл. отпуск. и б/л в текущем месяце");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ВыплатаОтпускныхИБЛВТекущемМесяце");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00400");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// ЗП текущего месяца :
	УдержаниеСтруктура = Новый Структура;   
	УдержаниеСтруктура.Вставить("Код","10003");
	УдержаниеСтруктура.Вставить("Наименование","ЗП текущего месяца");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ЗарплатаТекущегоМесяца");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00500");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// ЗП предыдущего месяца:
	УдержаниеСтруктура = Новый Структура; 
	УдержаниеСтруктура.Вставить("Код","10004");
	УдержаниеСтруктура.Вставить("Наименование","ЗП предыдущего месяца");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ЗарплатаПредыдущегоМесяца");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00501");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Межрасчетные выплаты:
	УдержаниеСтруктура = Новый Структура;    
	УдержаниеСтруктура.Вставить("Код","10005");
	УдержаниеСтруктура.Вставить("Наименование","Межрасчетные выплаты");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","МежрасчетныеВыплаты");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит",Кредит50);
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00081");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Профсоюзный взнос:
	УдержаниеСтруктура = Новый Структура;
	УдержаниеСтруктура.Вставить("Код","10008");
	УдержаниеСтруктура.Вставить("Наименование","Профсоюзный взнос");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ПрофсоюзныйВзнос");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
КонецПроцедуры                                      

Процедура ЗаполнитьКодыУдержаний_11_0_2_2() Экспорт
	
	Кредит50 = 	ПланыСчетов.инкХозрасчетный.Касса;
	Кредит51 = 	ПланыСчетов.инкХозрасчетный.РасчетныеСчета;
	Кредит76 =  ПланыСчетов.инкХозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами;
	
	// Аванс:
	УдержаниеСтруктура = Новый Структура;
	УдержаниеСтруктура.Вставить("Код","10080");
	УдержаниеСтруктура.Вставить("Наименование","Аванс");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","Аванс");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит",Кредит50);
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00080");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Выпл. отпуск. и б/л в текущем месяце:
	УдержаниеСтруктура = Новый Структура;  
	УдержаниеСтруктура.Вставить("Код","10400");
	УдержаниеСтруктура.Вставить("Наименование","Выпл. отпуск. и б/л в текущем месяце");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ВыплатаОтпускныхИБЛВТекущемМесяце");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00400");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// ЗП текущего месяца :
	УдержаниеСтруктура = Новый Структура;   
	УдержаниеСтруктура.Вставить("Код","10501");
	УдержаниеСтруктура.Вставить("Наименование","ЗП текущего месяца");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ЗарплатаТекущегоМесяца");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00501");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// ЗП предыдущего месяца:
	УдержаниеСтруктура = Новый Структура; 
	УдержаниеСтруктура.Вставить("Код","10500");
	УдержаниеСтруктура.Вставить("Наименование","ЗП предыдущего месяца");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ЗарплатаПредыдущегоМесяца");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00500");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Межрасчетные выплаты:
	УдержаниеСтруктура = Новый Структура;    
	УдержаниеСтруктура.Вставить("Код","10081");
	УдержаниеСтруктура.Вставить("Наименование","Межрасчетные выплаты");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","МежрасчетныеВыплаты");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит",Кредит50);
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00081");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Профсоюзный взнос:
	УдержаниеСтруктура = Новый Структура;
	УдержаниеСтруктура.Вставить("Код","20002");
	УдержаниеСтруктура.Вставить("Наименование","Профсоюзный взнос");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ПрофсоюзныйВзнос");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
КонецПроцедуры                                      


#КонецОбласти