
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчаниюНаСервере()
	
	Период.ДатаНачала = НачалоГода(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Дата1",Период.ДатаНачала);
	ДополнительныеПараметры.Вставить("Дата2",Период.ДатаОкончания);
	ДополнительныеПараметры.Вставить("Период",Период);
	
	ЭтаФорма.Закрыть(ДополнительныеПараметры);
	
КонецПроцедуры

