
#Область о // Печать результатов расчета:

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектНачисленияЗарплаты = Документы.инкНачислениеЗарплаты.НайтиПоНомеру("00000000001",Дата("20200101000000"));
	//Сотрудник = Справочники.инкСотрудники.НайтиПоКоду("000000001"); // Абрамов Геннадий Сергеевич
	ПериодПечати.ДатаНачала 	= НачалоГода(ТекущаяДата());
	ПериодПечати.ДатаОкончания 	= КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Функция ПечатьРезультатовРасчетаНаСервере()
	
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
    
    Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		СотрудникиМассив = Новый Массив;
		СотрудникиМассив.Добавить(Сотрудник);
		МенеджерПечати.СотрудникиМассив = СотрудникиМассив;
		
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ОбъектНачисленияЗарплаты) Тогда
        МенеджерПечати.ДокументОбъект = ОбъектНачисленияЗарплаты.ПолучитьОбъект();	
    Иначе    
        Сообщить("Для печати результатов расчета необходимо выбрать документ начисления зарплаты!");
    КонецЕсли; 
	
	ТабличныйДокумент = МенеджерПечати.ПолучитьРезультатРасчета();

	Возврат ТабличныйДокумент; 
	
КонецФункции

&НаКлиенте
Процедура ПечатьРезультатовРасчета(Команда)
	
	ТабличныйДокумент = ПечатьРезультатовРасчетаНаСервере();
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Расчетные листки",ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область о // Печать расчетных листков:

&НаСервере
Функция ПечатьРасчетныхЛистковНаСервере()
	
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
    
    МенеджерПечати.Дата1 = ПериодПечати.ДатаНачала;
	МенеджерПечати.Дата2 = ПериодПечати.ДатаОкончания;
    
    Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		СотрудникиМассив = Новый Массив;
		СотрудникиМассив.Добавить(Сотрудник);
		МенеджерПечати.СотрудникиМассив = СотрудникиМассив;
        
	КонецЕсли;
    
    Если ЗначениеЗаполнено(ОбъектНачисленияЗарплаты) Тогда
    	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
        	МенеджерПечати.ДокументОбъект = ОбъектНачисленияЗарплаты.ПолучитьОбъект();		
        КонецЕсли; 
    КонецЕсли; 
    
    Если Не ЗначениеЗаполнено(Сотрудник) И Не ЗначениеЗаполнено(ОбъектНачисленияЗарплаты) Тогда
        
        ДанныеНачисленияЗарплаты = инкСотрудникиСервер.ПолучитьСтруктуруПараметровДляЗапроса_Сотрудники();
        ДанныеНачисленияЗарплаты.Дата1 = ПериодПечати.ДатаНачала;
        ДанныеНачисленияЗарплаты.Дата2 = ПериодПечати.ДатаОкончания;
        МенеджерПечати.СотрудникиМассив = инкСотрудникиСервер.Выгрузить("Сотрудник");

    КонецЕсли; 
    
    ТабличныйДокумент = МенеджерПечати.ПолучитьРасчетныеЛистки();

	Возврат ТабличныйДокумент; 
	    
КонецФункции

&НаКлиенте
Процедура ПечатьРасчетныхЛистков(Команда)
	
	ТабличныйДокумент = ПечатьРасчетныхЛистковНаСервере();
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Расчетные листки",ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


