
#Область о //Стандартные процедуры и функции:

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Параметры.АдресПараметровВХранилище) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ПараметрыРасчета = ПолучитьИзВременногоХранилища(Параметры.АдресПараметровВХранилище);
	
	мПрочиеУдержанияТаблица.Очистить();
	Для каждого СотрудникЭлемент из ПараметрыРасчета.СотрудникиМассив Цикл
		НачислениеСтрока = мПрочиеУдержанияТаблица.Добавить();
		НачислениеСтрока.Сотрудник = СотрудникЭлемент;
	КонецЦикла;
	
	Элементы.мПрочиеУдержанияТаблица.Доступность = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура мПрочиеУдержанияТаблицаПриИзменении(Элемент)
	                            
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиСписком(Команда)
	
	РазмерУдержанияСумма = Элементы.мПрочиеУдержанияТаблица.ТекущиеДанные.РазмерУдержания;
	
	Если ЗначениеЗаполнено(РазмерУдержанияСумма) Тогда
		
		ДопПараметры = Новый Структура("РазмерУдержания",РазмерУдержанияСумма);
		
		ТекстВопроса = НСтр("ru = 'Ввести списком "+РазмерУдержанияСумма+"?'");
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьСпискомТЧВедомостьЗавершение", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьСпискомТЧВедомостьЗавершение(Знач Результат, Знач ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
	
		КолВо = мПрочиеУдержанияТаблица.Количество()-1;
		СчЦикла = 0;
		Для СчЦикла = 0 По КолВо Цикл
			Элементы.мПрочиеУдержанияТаблица.ДанныеСтроки(СчЦикла)["РазмерУдержания"] = ДопПараметры.РазмерУдержания;
		КонецЦикла;
						
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Удержать(Команда)
	
	ДопПараметры = Новый Структура;
	
	ТекстВопроса = НСтр("ru = 'Выполнить удержание?'");
	Оповещение = Новый ОписаниеОповещения("УдержатьЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры                                                 

&НаКлиенте
Процедура УдержатьЗавершение(Знач Результат, Знач ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
	
		Закрыть(ПоместитьИзмененныеДанныеВоВременноеХранилище());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(мУдержание) Тогда
		
		Элементы.мПрочиеУдержанияТаблица.Доступность = Истина;
		Для каждого УдержаниеСтрока Из мПрочиеУдержанияТаблица Цикл
			УдержаниеСтрока.Удержание = мУдержание;
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПереносВОсновнуюФорму

&НаСервере
Функция ПоместитьИзмененныеДанныеВоВременноеХранилище()
	         	
	ВозвращаемыеСведения = Новый Структура;
	ВозвращаемыеСведения.Вставить("мПрочиеУдержанияТаблица", Неопределено);
	
	Если ЗначениеЗаполнено(мУдержание) Тогда
		ВозвращаемыеСведения.мПрочиеУдержанияТаблица = мПрочиеУдержанияТаблица.Выгрузить();
	КонецЕсли; 
	
	Возврат ПоместитьВоВременноеХранилище(ВозвращаемыеСведения, Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти


