
#Область ОбновлениеИнформационнойБазы

&НаСервере
Процедура ОписатьДокумент(СсылкаНаЭлемент = Неопределено, Наименование = "", КодМВД = "", КодПФР = "")

	Если Не ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Если Наименование = "" Тогда
			Возврат
		КонецЕсли;
		СсылкаНаЭлемент = Справочники.инкВидыДокументовФизическихЛиц.НайтиПоНаименованию(Наименование);
	КонецЕсли;

	Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		ДанныеИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЭлемент, "КодМВД, КодПФР");
		Если ДанныеИБ.КодМВД = КодМВД И ДанныеИБ.КодПФР = КодПФР Тогда
			Возврат
		КонецЕсли;
		Элемент = СсылкаНаЭлемент.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.инкВидыДокументовФизическихЛиц.СоздатьЭлемент();
	КонецЕсли;

	Если ЗначениеЗаполнено(Наименование) Тогда
		Элемент.Наименование = Наименование;
	КонецЕсли;
	Элемент.КодМВД = КодМВД;
	Элемент.КодПФР = КодПФР;
	
	Элемент.ОбменДанными.Загрузка = Истина;
	Элемент.Записать();

КонецПроцедуры

// Обработчик обновления УТ 11.0.0.3
//
// Первоночальное заполнение элементов справочника.
//
Процедура ЗаполнитьВидыДокументов_11_0_0_3() Экспорт
	
	ОписатьДокумент(Справочники.инкВидыДокументовФизическихЛиц.ПаспортСССР,			"", 						"01", НСтр("ru='ПАСПОРТ'"));		// R-ББ 999999
	ОписатьДокумент(Справочники.инкВидыДокументовФизическихЛиц.ЗагранпаспортСССР,		"", 						"02", НСтр("ru='ЗГПАСПОРТ'"));		// 99 0999999
	ОписатьДокумент(Справочники.инкВидыДокументовФизическихЛиц.СвидетельствоОРождении,	"", 						"03", НСтр("ru='СВИД О РОЖД'"));	// R-ББ 999999
	ОписатьДокумент(Справочники.инкВидыДокументовФизическихЛиц.УдостоверениеОфицера,	"", 						"04", НСтр("ru='УДОСТ ОФИЦЕРА'"));	// ББ 9999990
	ОписатьДокумент(, НСтр("ru='Справка об освобождении'"),														"05", НСтр("ru='СПРАВКА ОБ ОСВ'"));	// -
	ОписатьДокумент(Справочники.инкВидыДокументовФизическихЛиц.ПаспортМинморфлота, 	"",							"06", НСтр("ru='ПАСПОРТ МОРФЛТ'"));	// ББ 999999
	ОписатьДокумент(Справочники.инкВидыДокументовФизическихЛиц.ВоенныйБилет,
		НСтр("ru='Военный билет солдата (матроса, сержанта, старшины)'"), 										"07", НСтр("ru='ВОЕННЫЙ БИЛЕТ'"));	// ББ 0999999
	// -
	ОписатьДокумент(, НСтр("ru='Временное удостоверение, выданное взамен военного билета'"),					"08", НСтр("ru='ПРОЧЕЕ'"));
	// 99 9999999
	ОписатьДокумент(Справочники.инкВидыДокументовФизическихЛиц.ДипломатическийПаспорт, "",							"09", НСтр("ru='ДИППАСПОРТ РФ'"));
	ОписатьДокумент(, НСтр("ru='Иностранный паспорт'"),															"10", НСтр("ru='ИНПАСПОРТ'"));		// -
	// -
	ОписатьДокумент(, НСтр("ru='Свидетельство о регистрации ходатайства иммигранта о признании его беженцем'"), "11", НСтр("ru='СВИД БЕЖЕНЦА'"));
	ОписатьДокумент(, НСтр("ru='Вид на жительство'"),															"12", НСтр("ru='ВИД НА ЖИТЕЛЬ'"));	// -
	ОписатьДокумент(, НСтр("ru='Удостоверение беженца'"),														"13", НСтр("ru='УДОСТ БЕЖЕНЦА'"));	// -
	// -
	ОписатьДокумент(, НСтр("ru='Временное удостоверение личности гражданина РФ'"),								"14", НСтр("ru='ВРЕМ УДОСТ'"));
	// -
	ОписатьДокумент(, НСтр("ru='Разрешение на временное проживание в Российской Федерации'"),					"15", НСтр("ru='ПРОЧЕЕ'"));
	ОписатьДокумент(,
		// ББ-999 9999999
		НСтр("ru='Свидетельство о предоставлении временного убежища на территории Российской Федерации'"), 		"18", НСтр("ru='ПРОЧЕЕ'"));
	ОписатьДокумент(Справочники.инкВидыДокументовФизическихЛиц.ПаспортРФ,				"",							"21", НСтр("ru='ПАСПОРТ РОССИИ'"));	// 99 99 9999990
	// 99 9999999
	ОписатьДокумент(Справочники.инкВидыДокументовФизическихЛиц.ЗагранпаспортРФ,		"",							"22", НСтр("ru='ЗГПАСПОРТ РФ'"));
	ОписатьДокумент(, 
		// -
		НСтр("ru='Свидетельство о рождении, выданное уполномоченным органом иностранного государства'"), 		"23", НСтр("ru='ПРОЧЕЕ'"));
	ОписатьДокумент(, НСтр("ru='Удостоверение личности военнослужащего Российской Федерации'"),					"24", НСтр("ru='ПРОЧЕЕ'"));			// ББ 9999999
	ОписатьДокумент(Справочники.инкВидыДокументовФизическихЛиц.ПаспортМоряка,			"",							"26", НСтр("ru='ПАСПОРТ МОРЯКА'"));	// ББ 0999999
	ОписатьДокумент(Справочники.инкВидыДокументовФизическихЛиц.ВоенныйБилетОфицераЗапаса, "",						"27", НСтр("ru='БИЛЕТ ОЗ'"));		// ББ 0999999
	ОписатьДокумент(, НСтр("ru='Иные документы, выдаваемые органами МВД'"),										"91", НСтр("ru='ПРОЧЕЕ'"));			// -

КонецПроцедуры

#КонецОбласти