
Процедура ЗаписьДвижений_инкКадроваяИсторияСотрудников()
	
	Движения.инкКадроваяИсторияСотрудников.Записывать = Истина;
	
	Движение = Движения.инкКадроваяИсторияСотрудников.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
	Движение.Период = КонецДня(ДатаУвольнения);
    Движение.ВидСобытия = Перечисления.инкВидыКадровыхСобытий.Увольнение;
	
КонецПроцедуры

Процедура ОбновлениеИнформацииОСотруднике(Режим)
    
    Если Режим = РежимЗаписиДокумента.Проведение Тогда
    	обСотрудник = ЭтотОбъект.Сотрудник.ПолучитьОбъект();
    	ЗаполнитьЗначенияСвойств(обСотрудник,ЭтотОбъект);
    	обСотрудник.Уволен = Истина;
    	обСотрудник.Записать();
    ИначеЕсли Режим = РежимЗаписиДокумента.ОтменаПроведения Тогда
    	обСотрудник = ЭтотОбъект.Сотрудник.ПолучитьОбъект();
    	ЗаполнитьЗначенияСвойств(обСотрудник,ЭтотОбъект);
    	обСотрудник.Уволен = Ложь;
    	обСотрудник.ДатаУвольнения = Неопределено;
    	обСотрудник.Записать();
    КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаписьДвижений_инкКадроваяИсторияСотрудников();
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    ОбновлениеИнформацииОСотруднике(РежимЗаписи);

КонецПроцедуры


