#Область о //Служебные процедуры и функции:

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЗаписьДвижений_инкРеестрБольничныхЛистов();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти	

#Область о //Дополнительные процедуры и функции:

#КонецОбласти	

#Область о //Запись движений:

Процедура ЗаписьДвижений_инкРеестрБольничныхЛистов()
	
	Движения.инкРеестрБольничныхЛистов.Записывать = Истина;
	
	Движение = Движения.инкРеестрБольничныхЛистов.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
	Движение.БольничныйЛист = ЭтотОбъект.Ссылка;
	
КонецПроцедуры

#КонецОбласти	

