
#Область о //Обработчики событий - справочники

Процедура ПередЗаписью_Справочники(Источник, Отказ) Экспорт
	
	инкОбщийСервер.ДобавитьПризнакЭтоНовый(Источник);
	
КонецПроцедуры

#КонецОбласти

#Область о //Обработчики событий - документы

Процедура ПередЗаписью_Документы(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	инкОбщийСервер.ДобавитьПризнакЭтоНовый(Источник);
	
	// Запись ответственного:
	Если инкОбщийКлиентСервер.ЕстьСвойство(Источник,"Ответственный") Тогда
		Если Не ЗначениеЗаполнено(Источник.Ответственный) ИЛИ Источник.ЭтоНовый() Тогда
			Источник.Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

